INSERT INTO achievements (id, code, title, description)
VALUES
-- STREAK
(uuid_generate_v4(), 'STREAK_3', 'Тұрақты бастау', '3 күн қатарынан сөйлеу сапасы жақсы болды'),
(uuid_generate_v4(), 'STREAK_7', 'Бірқалыпты қарқын', '7 күн қатарынан сөйлеу қарқыны тұрақты'),
(uuid_generate_v4(), 'STREAK_14', 'Жүктемедегі бақылау', '14 күн қатарынан жоғары сапада сөйлеу'),

-- SKILL
(uuid_generate_v4(), 'GOOD_SCORE_90', 'Айқын прогресс', 'Бір жаттығуда 90 және одан жоғары балл жинады'),
(uuid_generate_v4(), 'GOOD_SCORE_90_3', 'Дәлдікке фокус', 'Қатарынан 3 жаттығуда 90 және одан жоғары балл'),
(uuid_generate_v4(), 'GOOD_SCORE_90_5', 'Жоғары сөйлеу деңгейі', 'Қатарынан 5 жаттығуда 90 және одан жоғары балл'),

-- UNIT
(uuid_generate_v4(), 'UNIT_90', 'Сенімді бөлім', 'Бөлім бойынша орташа балл 90 және одан жоғары'),
(uuid_generate_v4(), 'UNIT_95', 'Таза аяқтау', 'Бөлім бойынша орташа балл 95 және одан жоғары'),

-- COURSE
(uuid_generate_v4(), 'COURSE_90', 'Шебер деңгей', 'Курсты орташа балл 90 және одан жоғары аяқтау');